[NoCoverage] Block removal mutation
Entities/MovieInformation.cs:24:9
         #region Implement IEquatable
 
         public bool Equals(MovieInformation other)
-        {
-            if (ReferenceEquals(null, other)) return false;
-            if (ReferenceEquals(this, other)) return true;
-
-            return string.Equals(Titre, other.Titre);
-        }
+        {}
 
         public override bool Equals(object obj)

[NoCoverage] Boolean mutation
Entities/MovieInformation.cs:25:54
 
         public bool Equals(MovieInformation other)
         {
-            if (ReferenceEquals(null, other)) return false;
+            if (ReferenceEquals(null, other)) return true;
             if (ReferenceEquals(this, other)) return true;
 

[NoCoverage] Negate expression
Entities/MovieInformation.cs:25:17
 
         public bool Equals(MovieInformation other)
         {
-            if (ReferenceEquals(null, other)) return false;
+            if (!(ReferenceEquals(null, other))) return false;
             if (ReferenceEquals(this, other)) return true;
 

[NoCoverage] Boolean mutation
Entities/MovieInformation.cs:26:54
         public bool Equals(MovieInformation other)
         {
             if (ReferenceEquals(null, other)) return false;
-            if (ReferenceEquals(this, other)) return true;
+            if (ReferenceEquals(this, other)) return false;
 
             return string.Equals(Titre, other.Titre);

[NoCoverage] Negate expression
Entities/MovieInformation.cs:26:17
         public bool Equals(MovieInformation other)
         {
             if (ReferenceEquals(null, other)) return false;
-            if (ReferenceEquals(this, other)) return true;
+            if (!(ReferenceEquals(this, other))) return true;
 
             return string.Equals(Titre, other.Titre);

[NoCoverage] Block removal mutation
Entities/MovieInformation.cs:32:9
         }
 
         public override bool Equals(object obj)
-        {
-            if (ReferenceEquals(null, obj)) return false;
-            if (ReferenceEquals(this, obj)) return true;
-
-            if (obj.GetType() != this.GetType()) return false;
-            return Equals((MovieInformation)obj);
-        }
+        {}
 
         public override int GetHashCode()

[NoCoverage] Negate expression
Entities/MovieInformation.cs:33:17
 
         public override bool Equals(object obj)
         {
-            if (ReferenceEquals(null, obj)) return false;
+            if (!(ReferenceEquals(null, obj))) return false;
             if (ReferenceEquals(this, obj)) return true;
 

[NoCoverage] Boolean mutation
Entities/MovieInformation.cs:33:52
 
         public override bool Equals(object obj)
         {
-            if (ReferenceEquals(null, obj)) return false;
+            if (ReferenceEquals(null, obj)) return true;
             if (ReferenceEquals(this, obj)) return true;
 

[NoCoverage] Boolean mutation
Entities/MovieInformation.cs:34:52
         public override bool Equals(object obj)
         {
             if (ReferenceEquals(null, obj)) return false;
-            if (ReferenceEquals(this, obj)) return true;
+            if (ReferenceEquals(this, obj)) return false;
 
             if (obj.GetType() != this.GetType()) return false;

[NoCoverage] Negate expression
Entities/MovieInformation.cs:34:17
         public override bool Equals(object obj)
         {
             if (ReferenceEquals(null, obj)) return false;
-            if (ReferenceEquals(this, obj)) return true;
+            if (!(ReferenceEquals(this, obj))) return true;
 
             if (obj.GetType() != this.GetType()) return false;

[NoCoverage] Equality mutation
Entities/MovieInformation.cs:36:17
             if (ReferenceEquals(null, obj)) return false;
             if (ReferenceEquals(this, obj)) return true;
 
-            if (obj.GetType() != this.GetType()) return false;
+            if (obj.GetType() == this.GetType()) return false;
             return Equals((MovieInformation)obj);
         }

[NoCoverage] Boolean mutation
Entities/MovieInformation.cs:36:57
             if (ReferenceEquals(null, obj)) return false;
             if (ReferenceEquals(this, obj)) return true;
 
-            if (obj.GetType() != this.GetType()) return false;
+            if (obj.GetType() != this.GetType()) return true;
             return Equals((MovieInformation)obj);
         }

[NoCoverage] Block removal mutation
Entities/MovieInformation.cs:41:9
         }
 
         public override int GetHashCode()
-        {
-            return (Titre != null ? Titre.GetHashCode() : 0);
-        }
+        {}
 
         #endregion

[NoCoverage] Equality mutation
Entities/MovieInformation.cs:42:21
 
         public override int GetHashCode()
         {
-            return (Titre != null ? Titre.GetHashCode() : 0);
+            return (Titre == null  ? Titre.GetHashCode() : 0);
         }
 
