[NoCoverage] Block removal mutation
Entities/ShowInformation.cs:27:3
 		#endregion
 
 		public bool Equals(ShowInformation other)
-		{
-			if (ReferenceEquals(null, other)) return false;
-			if (ReferenceEquals(this, other)) return true;
-
-			return string.Equals(Titre, other.Titre)
-				&& Saison == other.Saison 
-				&& Episode == other.Episode;
-		}
+		{}
 
 		public override bool Equals(object obj)

[NoCoverage] Logical mutation
Entities/ShowInformation.cs:31:11
 			if (ReferenceEquals(null, other)) return false;
 			if (ReferenceEquals(this, other)) return true;
 
-			return string.Equals(Titre, other.Titre)
-				&& Saison == other.Saison 
-				&& Episode == other.Episode;
+			return string.Equals(Titre, other.Titre)
+				&& Saison == other.Saison 
+				|| Episode == other.Episode;
 		}
 

[NoCoverage] Logical mutation
Entities/ShowInformation.cs:31:11
 			if (ReferenceEquals(null, other)) return false;
 			if (ReferenceEquals(this, other)) return true;
 
-			return string.Equals(Titre, other.Titre)
-				&& Saison == other.Saison 
+			return string.Equals(Titre, other.Titre)
+				|| Saison == other.Saison 
+ 
 				&& Episode == other.Episode;
 		}

[NoCoverage] Equality mutation
Entities/ShowInformation.cs:32:8
 			if (ReferenceEquals(this, other)) return true;
 
 			return string.Equals(Titre, other.Titre)
-				&& Saison == other.Saison 
+				&& Saison != other.Saison 
+ 
 				&& Episode == other.Episode;
 		}

[NoCoverage] Equality mutation
Entities/ShowInformation.cs:33:8
 
 			return string.Equals(Titre, other.Titre)
 				&& Saison == other.Saison 
-				&& Episode == other.Episode;
+				&& Episode != other.Episode;
 		}
 

[NoCoverage] Block removal mutation
Entities/ShowInformation.cs:37:3
 		}
 
 		public override bool Equals(object obj)
-		{
-			if (ReferenceEquals(null, obj)) return false;
-			if (ReferenceEquals(this, obj)) return true;
-
-			if (obj.GetType() != this.GetType()) return false;
-			return Equals((ShowInformation) obj);
-		}
+		{}
 
 		public override int GetHashCode()

[NoCoverage] Block removal mutation
Entities/ShowInformation.cs:46:3
 		}
 
 		public override int GetHashCode()
-		{
-			return (Titre != null ? Titre.GetHashCode() : 0) + Saison.GetHashCode() + Episode.GetHashCode();
-		}
+		{}
 	}
 }

[NoCoverage] Arithmetic mutation
Entities/ShowInformation.cs:47:11
 
 		public override int GetHashCode()
 		{
-			return (Titre != null ? Titre.GetHashCode() : 0) + Saison.GetHashCode() + Episode.GetHashCode();
+			return (Titre != null ? Titre.GetHashCode() : 0) - Saison.GetHashCode()  + Episode.GetHashCode();
 		}
 	}

[NoCoverage] Arithmetic mutation
Entities/ShowInformation.cs:47:11
 
 		public override int GetHashCode()
 		{
-			return (Titre != null ? Titre.GetHashCode() : 0) + Saison.GetHashCode() + Episode.GetHashCode();
+			return (Titre != null ? Titre.GetHashCode() : 0) + Saison.GetHashCode() - Episode.GetHashCode();
 		}
 	}
