[Killed] Block removal mutation
MovieFileParser.cs:46:9
         /// </summary>
         /// <param name="langues">Liste des langues que l'utilisateur veut r�cup�rer.</param>
         public MovieFileParser(params string[] langues)
-        {
-            _languesPattern = BuildPattern(langues);
-        }
+        {}
 
         #endregion
statusReason: not run

[Killed] Block removal mutation
MovieFileParser.cs:64:9
         /// <param name="type">Donne le type de vid�o.</param>
         /// <returns></returns>
         public MovieInformation GetInformation(string title, string fileName, long sizeByte, TypeVideo type)
-        {
-            MovieInformation result = new MovieInformation();
-            result.FileName = fileName;
-            result.Size = sizeByte;
-            result.TypeVideo = type;
-
-            title = RemoveExtraInformation(title);
-            title = ReplaceCharacters(title);
-
-            result.Resolution = GetResolution(ref title, RESOLUTION_PATTERN);
-            result.Qualite = GetQuality(ref title, QUALITY_PATTERN);
-            result.Annee = GetAnneeProduction(ref title);
-            result.Langage = GetLanguage(ref title);
-            result.Titre = GetTitle(title);
-
-            return result;
-        }
+        {}
 
         #endregion
statusReason: not run

[Killed] Block removal mutation
MovieFileParser.cs:92:9
         /// <param name="titre"></param>
         /// <returns></returns>
         private string ExtractRomanNumber(string titre)
-        {
-            string tempTitre = titre;
-            Match matchResult = Regex.Match(tempTitre, CHIFFRE_ROMAIN_PATTERN);
-
-            if (!string.IsNullOrEmpty(matchResult.Value))
-            {
-                string temp = matchResult.Value.Replace(" ", string.Empty);
-
-                foreach (ChiffreRomain chiffreRomain in _chiffreRomainsCollection)
-                {
-                    if (temp == chiffreRomain.ToString("f"))
-                    {
-                        tempTitre = tempTitre.Replace(matchResult.Value, " " + chiffreRomain.ToString("d"));
-                    }
-                }
-            }
-
-            return tempTitre;
-        }
+        {}
 
         /// <summary>
statusReason: not run

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
MovieFileParser.cs:96:17
             string tempTitre = titre;
             Match matchResult = Regex.Match(tempTitre, CHIFFRE_ROMAIN_PATTERN);
 
-            if (!string.IsNullOrEmpty(matchResult.Value))
+            if (string.IsNullOrEmpty(matchResult.Value))
             {
                 string temp = matchResult.Value.Replace(" ", string.Empty);
statusReason: not run

[Killed] Block removal mutation
MovieFileParser.cs:97:13
             Match matchResult = Regex.Match(tempTitre, CHIFFRE_ROMAIN_PATTERN);
 
             if (!string.IsNullOrEmpty(matchResult.Value))
-            {
-                string temp = matchResult.Value.Replace(" ", string.Empty);
-
-                foreach (ChiffreRomain chiffreRomain in _chiffreRomainsCollection)
-                {
-                    if (temp == chiffreRomain.ToString("f"))
-                    {
-                        tempTitre = tempTitre.Replace(matchResult.Value, " " + chiffreRomain.ToString("d"));
-                    }
-                }
-            }
+            {}
 
             return tempTitre;
statusReason: not run

[Killed] Block removal mutation
MovieFileParser.cs:101:17
                 string temp = matchResult.Value.Replace(" ", string.Empty);
 
                 foreach (ChiffreRomain chiffreRomain in _chiffreRomainsCollection)
-                {
-                    if (temp == chiffreRomain.ToString("f"))
-                    {
-                        tempTitre = tempTitre.Replace(matchResult.Value, " " + chiffreRomain.ToString("d"));
-                    }
-                }
+                {}
             }
 
statusReason: not run

[Killed] Equality mutation
MovieFileParser.cs:102:25
 
                 foreach (ChiffreRomain chiffreRomain in _chiffreRomainsCollection)
                 {
-                    if (temp == chiffreRomain.ToString("f"))
+                    if (temp != chiffreRomain.ToString("f"))
                     {
                         tempTitre = tempTitre.Replace(matchResult.Value, " " + chiffreRomain.ToString("d"));
statusReason: not run

[Survived] String mutation
MovieFileParser.cs:102:56
 
                 foreach (ChiffreRomain chiffreRomain in _chiffreRomainsCollection)
                 {
-                    if (temp == chiffreRomain.ToString("f"))
+                    if (temp == chiffreRomain.ToString(""))
                     {
                         tempTitre = tempTitre.Replace(matchResult.Value, " " + chiffreRomain.ToString("d"));

[Killed] Block removal mutation
MovieFileParser.cs:103:21
                 foreach (ChiffreRomain chiffreRomain in _chiffreRomainsCollection)
                 {
                     if (temp == chiffreRomain.ToString("f"))
-                    {
-                        tempTitre = tempTitre.Replace(matchResult.Value, " " + chiffreRomain.ToString("d"));
-                    }
+                    {}
                 }
             }
statusReason: not run

[Killed] String mutation
MovieFileParser.cs:104:74
                 {
                     if (temp == chiffreRomain.ToString("f"))
                     {
-                        tempTitre = tempTitre.Replace(matchResult.Value, " " + chiffreRomain.ToString("d"));
+                        tempTitre = tempTitre.Replace(matchResult.Value, "" + chiffreRomain.ToString("d"));
                     }
                 }
statusReason: not run

[Killed] Block removal mutation
MovieFileParser.cs:119:9
         /// <param name="pattern"></param>
         /// <returns></returns>
         private string GetResolution(ref string title, string pattern)
-        {
-            Match matchResult = Regex.Match(title, pattern);
-            title = RemoveResultRegex(matchResult.Value, title);
-
-            return string.IsNullOrEmpty(matchResult.Value)
-                ? INCONNU
-                : matchResult.Value;
-        }
+        {}
 
         /// <summary>
statusReason: not run

[Killed] Negate expression
MovieFileParser.cs:123:20
             Match matchResult = Regex.Match(title, pattern);
             title = RemoveResultRegex(matchResult.Value, title);
 
-            return string.IsNullOrEmpty(matchResult.Value)
+            return !(string.IsNullOrEmpty(matchResult.Value)
+)
                 ? INCONNU
                 : matchResult.Value;
statusReason: not run

[Killed] Block removal mutation
MovieFileParser.cs:135:9
         /// <param name="pattern">Pattern du Regex.</param>
         /// <returns></returns>
         private string GetQuality(ref string title, string pattern)
-        {
-            var matchResult = Regex.Match(title, pattern);
-            title = RemoveResultRegex(matchResult.Value, title);
-
-            return string.IsNullOrEmpty(matchResult.Value)
-                ? INCONNU
-                : matchResult.Value.Replace(".", String.Empty);
-        }
+        {}
 
         /// <summary>
statusReason: not run

[Killed] Block removal mutation
MovieFileParser.cs:151:9
         /// <param name="titre"></param>
         /// <returns></returns>
         private string RemoveResultRegex(string resultatRegex, string titre)
-        {
-            return !string.IsNullOrEmpty(resultatRegex)
-                ? titre.Replace(resultatRegex, string.Empty)
-                : titre;
-        }
+        {}
 
         /// <summary>
statusReason: not run

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
MovieFileParser.cs:152:20
         /// <returns></returns>
         private string RemoveResultRegex(string resultatRegex, string titre)
         {
-            return !string.IsNullOrEmpty(resultatRegex)
+            return string.IsNullOrEmpty(resultatRegex)
+
                 ? titre.Replace(resultatRegex, string.Empty)
                 : titre;
statusReason: not run

[Killed] String mutation
MovieFileParser.cs:153:48
         private string RemoveResultRegex(string resultatRegex, string titre)
         {
             return !string.IsNullOrEmpty(resultatRegex)
-                ? titre.Replace(resultatRegex, string.Empty)
+                ? titre.Replace(resultatRegex, "Stryker was here!")
                 : titre;
         }
statusReason: not run

[Killed] Block removal mutation
MovieFileParser.cs:194:3
 		/// <param name="title"></param>
 		/// <returns></returns>
 		private string GetAnneeProduction(ref string title)
-		{
-			const string patternAnnee = "[0-9]{4}";
-			Match matchResult = Regex.Match(title, patternAnnee, RegexOptions.RightToLeft);
-
-			title = RemoveResultRegex(matchResult.Value, title);
-
-			return string.IsNullOrEmpty(matchResult.Value)
-				? INCONNU
-				: matchResult.Value;
-		}
+		{}
 
 		/// <summary>
statusReason: not run

[Killed] Block removal mutation
MovieFileParser.cs:211:9
 		/// </summary>
 		/// <returns></returns>
 		private string GetLanguage(ref string title)
-        {
-            string titleTempMajuscule = title.ToUpper();
-            Match matchResult = Regex.Match(titleTempMajuscule, _languesPattern);
-
-            title = RemoveResultRegex(matchResult.Value, titleTempMajuscule);
-
-            return string.IsNullOrEmpty(matchResult.Value)
-                ? INCONNU
-                : matchResult.Value.Replace(".", string.Empty);
-        }
+        {}
 
         /// <summary>
statusReason: not run

[Killed] Block removal mutation
MovieFileParser.cs:228:9
         /// <param name="langues"></param>
         /// <returns></returns>
         private string BuildPattern(string[] langues)
-        {
-            // Il faut que le pattern commence par '.'
-            string result = @"(";
-
-            for (int i = 0; i < langues.Length; i++)
-            {
-                if (i == langues.Length - 1)
-                    result += langues[i].ToUpper();
-                else
-                    result += langues[i].ToUpper() + "|"; // '|' signe 'ou' pour le pattern.
-            }
-
-            // et finisse par un '.'
-            result += @")";
-
-            return result;
-        }
+        {}
 
         #endregion
statusReason: not run

[Killed] String mutation
MovieFileParser.cs:230:29
         private string BuildPattern(string[] langues)
         {
             // Il faut que le pattern commence par '.'
-            string result = @"(";
+            string result = "";
 
             for (int i = 0; i < langues.Length; i++)
statusReason: not run

[Killed] Equality mutation
MovieFileParser.cs:232:29
             // Il faut que le pattern commence par '.'
             string result = @"(";
 
-            for (int i = 0; i < langues.Length; i++)
+            for (int i = 0; i > langues.Length; i++)
             {
                 if (i == langues.Length - 1)
statusReason: not run

[Killed] Equality mutation
MovieFileParser.cs:232:29
             // Il faut que le pattern commence par '.'
             string result = @"(";
 
-            for (int i = 0; i < langues.Length; i++)
+            for (int i = 0; i <= langues.Length; i++)
             {
                 if (i == langues.Length - 1)
statusReason: not run

[Killed] Block removal mutation
MovieFileParser.cs:233:13
             string result = @"(";
 
             for (int i = 0; i < langues.Length; i++)
-            {
-                if (i == langues.Length - 1)
-                    result += langues[i].ToUpper();
-                else
-                    result += langues[i].ToUpper() + "|"; // '|' signe 'ou' pour le pattern.
-            }
+            {}
 
             // et finisse par un '.'
statusReason: not run

[Killed] Arithmetic mutation
MovieFileParser.cs:234:26
 
             for (int i = 0; i < langues.Length; i++)
             {
-                if (i == langues.Length - 1)
+                if (i == langues.Length + 1)
                     result += langues[i].ToUpper();
                 else
statusReason: not run

[Killed] Equality mutation
MovieFileParser.cs:234:21
 
             for (int i = 0; i < langues.Length; i++)
             {
-                if (i == langues.Length - 1)
+                if (i != langues.Length - 1)
                     result += langues[i].ToUpper();
                 else
statusReason: not run
