[Killed] Collection initializer mutation
MovieManager.cs:20:64
         /// <summary>
         /// Contient les noms des extensions possibles pour les films et séries.
         /// </summary>
-        private IEnumerable<string> _fileExtensionCollection = new List<string>()
-        {
-            ".avi", ".mkv", ".mp4"
-        };
+        private IEnumerable<string> _fileExtensionCollection = new List<string>()
+{};
 
         private MovieFileParser _movieFileParser;
statusReason: not run

[Killed] String mutation
MovieManager.cs:22:21
         /// </summary>
         private IEnumerable<string> _fileExtensionCollection = new List<string>()
         {
-            ".avi", ".mkv", ".mp4"
+            ".avi", "", ".mp4"
         };
 
statusReason: not run

[Killed] Block removal mutation
MovieManager.cs:36:9
         /// </summary>
         /// <param name="languesChoisis"></param>
         public MovieManager(params string[] languesChoisis)
-        {
-            _movieFileParser = new MovieFileParser(languesChoisis);
-        }
+        {}
 
         #endregion
statusReason: not run

[Killed] Block removal mutation
MovieManager.cs:51:9
         /// <param name="type">Donne le type de vidéo.</param>
         /// <returns></returns>
         public IEnumerable<MovieInformation> GetMoviesInformations(string path, TypeVideo type)
-        {
-            List<MovieInformation> retourInformations = new List<MovieInformation>();
-            FileInfo[] videoFiles = GetAllVideoFiles(path);
-
-            foreach (var file in videoFiles)
-            {
-                string fileName = RemoveExtension(file);
-                MovieInformation information = _movieFileParser.GetInformation(fileName, file.Name, file.Length, type);
-                information.PathFile = file.FullName;
-
-                retourInformations.Add(information);
-            }
-
-            return retourInformations;
-        }
+        {}
 
         #endregion
statusReason: not run

[Killed] Block removal mutation
MovieManager.cs:56:13
             FileInfo[] videoFiles = GetAllVideoFiles(path);
 
             foreach (var file in videoFiles)
-            {
-                string fileName = RemoveExtension(file);
-                MovieInformation information = _movieFileParser.GetInformation(fileName, file.Name, file.Length, type);
-                information.PathFile = file.FullName;
-
-                retourInformations.Add(information);
-            }
+            {}
 
             return retourInformations;
statusReason: not run

[Killed] Statement mutation
MovieManager.cs:61:17
                 MovieInformation information = _movieFileParser.GetInformation(fileName, file.Name, file.Length, type);
                 information.PathFile = file.FullName;
 
-                retourInformations.Add(information);
+                ;
             }
 
statusReason: not run

[Killed] Block removal mutation
MovieManager.cs:79:9
         /// <param name="path"></param>
         /// <returns></returns>
         private FileInfo[] GetAllVideoFiles(string path)
-        {
-            DirectoryInfo directory = new DirectoryInfo(path);
-            FileInfo[] allFiles = directory.GetFiles("*", SearchOption.AllDirectories);
-
-            return allFiles.Where(x => _fileExtensionCollection.Contains(x.Extension)).ToArray();
-        }
+        {}
 
         /// <summary>
statusReason: not run

[Killed] Block removal mutation
MovieManager.cs:92:9
         /// <param name="file"></param>
         /// <returns></returns>
         private string RemoveExtension(FileInfo file)
-        {
-            return file.Name.Replace(file.Extension, string.Empty);
-        }
+        {}
 
         #endregion
statusReason: not run
