[Killed] Block removal mutation
ShowFileParser.cs:32:3
 		/// </summary>
 		/// <param name="langues">Liste des langues que l'utilisateur veut récupérer.</param>
 		public ShowFileParser(params string[] langues)
-		{
-			_languesPattern = BuildPattern(langues);
-		}		
+		{}		
 
 		#endregion
statusReason: not run

[Killed] Block removal mutation
ShowFileParser.cs:48:6
 		/// <param name="sizeByte"></param>
 		/// <returns></returns>
 		public ShowInformation GetShow(string title, string fileName, long sizeByte)
-	    {
-		    ShowInformation result = new ShowInformation();
-	        result.FileName = fileName;
-	        result.Size = sizeByte;
-
-			title = RemoveExtraInformation(title);
-			title = ReplaceCharacters(title);
-
-			if (Regex.IsMatch(title, SAISON_PATTERN))
-				result.Saison = GetSeasonOrEpisode(ref title, SAISON_PATTERN);
-
-		    if (Regex.IsMatch(title, EPISODE_PATTERN))
-			    result.Episode = GetSeasonOrEpisode(ref title, EPISODE_PATTERN);
-
-			result.Resolution = GetResolution(ref title, RESOLUTION_PATTERN);
-			result.Qualite = GetQuality(title, QUALITY_PATTERN);
-			result.Langage = GetLanguage(title);
-
-		    result.Titre = GetTitle(title);
-
-			return result;  
-	    }
+	    {}
 		
 	    #endregion
statusReason: not run

[Killed] Negate expression
ShowFileParser.cs:56:8
 			title = RemoveExtraInformation(title);
 			title = ReplaceCharacters(title);
 
-			if (Regex.IsMatch(title, SAISON_PATTERN))
+			if (!(Regex.IsMatch(title, SAISON_PATTERN)))
 				result.Saison = GetSeasonOrEpisode(ref title, SAISON_PATTERN);
 
statusReason: not run

[Killed] Negate expression
ShowFileParser.cs:59:11
 			if (Regex.IsMatch(title, SAISON_PATTERN))
 				result.Saison = GetSeasonOrEpisode(ref title, SAISON_PATTERN);
 
-		    if (Regex.IsMatch(title, EPISODE_PATTERN))
+		    if (!(Regex.IsMatch(title, EPISODE_PATTERN)))
 			    result.Episode = GetSeasonOrEpisode(ref title, EPISODE_PATTERN);
 
statusReason: not run

[Killed] Block removal mutation
ShowFileParser.cs:82:6
 		/// <param name="pattern"></param>
 		/// <returns></returns>
 	    private short GetSeasonOrEpisode(ref string title, string pattern)
-	    {
-			// Récupération de l'information.
-		    var matchResult = Regex.Match(title, pattern);
-
-			// Suppression du resultat trouvé du titre.
-		    title = RemoveResultRegex(matchResult.Value, title);
-
-			// Récupération du numéro de l'épisode/Saison.
-			// [^0-9] : Tout ce qui ne correspond pas à un nombre.
-			var result = Regex.Replace(matchResult.Value, @"[^0-9]", string.Empty);
-		    return Convert.ToInt16(result);
-	    }
+	    {}
 
 		/// <summary>
statusReason: not run

[Killed] Block removal mutation
ShowFileParser.cs:102:6
 		/// <param name="pattern">Pattern du Regex.</param>
 		/// <returns></returns>
 	    private string GetQuality(string title, string pattern)
-	    {
-		    var matchResult = Regex.Match(title, pattern);
-            RemoveResultRegex(matchResult.Value, title);
-
-			return string.IsNullOrEmpty(matchResult.Value)
-			    ? INCONNU
-				: matchResult.Value.Replace(".", String.Empty);
-	    }
+	    {}
 
 	    /// <summary>
statusReason: not run

[Survived] Statement mutation
ShowFileParser.cs:104:13
 	    private string GetQuality(string title, string pattern)
 	    {
 		    var matchResult = Regex.Match(title, pattern);
-            RemoveResultRegex(matchResult.Value, title);
+            ;
 
 			return string.IsNullOrEmpty(matchResult.Value)

[Killed] Block removal mutation
ShowFileParser.cs:146:3
 		/// <param name="title"></param>
 		/// <returns></returns>
 	    private string GetTitle(string title)
-		{
-			int indexDoublePoint = title.IndexOf("..");
-
-			if (indexDoublePoint > 0)
-			{
-				title = title.Substring(0, indexDoublePoint);
-			}
-			string retourTitle = title.Replace('.', ' ');
-
-			// J'enlève tous caractères qui n'est pas alphabétique.
-			// \W tous les caractères qui ne sont pas alphanumérique
-			// ^\s exception sur les espaces.
-			string result = Regex.Replace(retourTitle, @"\W^\s", string.Empty);
-
-			return result;
-		}
+		{}
 
 		/// <summary>
statusReason: not run

[Killed] String mutation
ShowFileParser.cs:147:41
 		/// <returns></returns>
 	    private string GetTitle(string title)
 		{
-			int indexDoublePoint = title.IndexOf("..");
+			int indexDoublePoint = title.IndexOf("");
 
 			if (indexDoublePoint > 0)
statusReason: not run

[Killed] Negate expression
ShowFileParser.cs:149:8
 		{
 			int indexDoublePoint = title.IndexOf("..");
 
-			if (indexDoublePoint > 0)
+			if (!(indexDoublePoint > 0))
 			{
 				title = title.Substring(0, indexDoublePoint);
statusReason: not run

[Killed] Equality mutation
ShowFileParser.cs:149:8
 		{
 			int indexDoublePoint = title.IndexOf("..");
 
-			if (indexDoublePoint > 0)
+			if (indexDoublePoint < 0)
 			{
 				title = title.Substring(0, indexDoublePoint);
statusReason: not run

[Killed] Block removal mutation
ShowFileParser.cs:150:4
 			int indexDoublePoint = title.IndexOf("..");
 
 			if (indexDoublePoint > 0)
-			{
-				title = title.Substring(0, indexDoublePoint);
-			}
+			{}
 			string retourTitle = title.Replace('.', ' ');
 
statusReason: not run

[Killed] Block removal mutation
ShowFileParser.cs:169:3
 		/// </summary>
 		/// <returns></returns>
 		private string GetLanguage(string titleTorrent)
-		{
-			string titleTempMajuscule = titleTorrent.ToUpper();
-			Match matchResult = Regex.Match(titleTempMajuscule, _languesPattern);
-
-			return string.IsNullOrEmpty(matchResult.Value)
-				? INCONNU
-				: matchResult.Value.Replace(".", string.Empty);
-		}
+		{}
 
 		/// <summary>
statusReason: not run

[Killed] Block removal mutation
ShowFileParser.cs:184:3
 		/// <param name="langues"></param>
 		/// <returns></returns>
 		private string BuildPattern(string[] langues)
-		{
-			// Il faut que le pattern commence par '.'
-			string result = @"(\.)(";
-
-			for (int i = 0; i < langues.Length; i++)
-			{
-				if(i == langues.Length - 1)
-					result += ( langues[i].ToUpper());
-				else
-					result += (langues[i].ToUpper() + "|"); // '|' signe 'ou' pour le pattern.
-			}
-
-			// et finisse par un '.'
-			result += @")(\.)";
-
-			return result;
-		}
+		{}
 
 		#endregion
statusReason: not run

[Killed] PostIncrementExpression to PostDecrementExpression mutation
ShowFileParser.cs:188:40
 			// Il faut que le pattern commence par '.'
 			string result = @"(\.)(";
 
-			for (int i = 0; i < langues.Length; i++)
+			for (int i = 0; i < langues.Length; i--)
 			{
 				if(i == langues.Length - 1)
statusReason: not run

[Killed] Block removal mutation
ShowFileParser.cs:189:4
 			string result = @"(\.)(";
 
 			for (int i = 0; i < langues.Length; i++)
-			{
-				if(i == langues.Length - 1)
-					result += ( langues[i].ToUpper());
-				else
-					result += (langues[i].ToUpper() + "|"); // '|' signe 'ou' pour le pattern.
-			}
+			{}
 
 			// et finisse par un '.'
statusReason: not run
