[NoCoverage] String mutation
ShowManager.cs:19:29
         /// </summary>
         private IEnumerable<string> _fileExtensionCollection = new List<string>()
         {
-            ".avi", ".mkv", ".mp4"
+            ".avi", ".mkv", ""
         };
 

[NoCoverage] Block removal mutation
ShowManager.cs:29:9
         #region Constructeur
 
         public ShowManager(params string[] languesChoisis)
-        {
-            _showFileParser = new ShowFileParser(languesChoisis);
-        }
+        {}
 
         #endregion

[NoCoverage] Block removal mutation
ShowManager.cs:43:9
         /// <param name="path"></param>
         /// <returns></returns>
         public IEnumerable<ShowInformation> GetShowsInformation(string path)
-        {
-            List<ShowInformation> retourInformations = new List<ShowInformation>();
-            FileInfo[] videoFiles = GetAllVideoFiles(path);
-
-            foreach (var file in videoFiles)
-            {
-                string fileName = RemoveExtension(file);
-                ShowInformation information = _showFileParser.GetShow(fileName, file.Name, file.Length);
-                information.PathFile = file.FullName;
-
-                retourInformations.Add(information);
-            }
-
-            return retourInformations;
-        }
+        {}
 
         #endregion

[NoCoverage] Block removal mutation
ShowManager.cs:48:13
             FileInfo[] videoFiles = GetAllVideoFiles(path);
 
             foreach (var file in videoFiles)
-            {
-                string fileName = RemoveExtension(file);
-                ShowInformation information = _showFileParser.GetShow(fileName, file.Name, file.Length);
-                information.PathFile = file.FullName;
-
-                retourInformations.Add(information);
-            }
+            {}
 
             return retourInformations;

[NoCoverage] String mutation
ShowManager.cs:73:54
         private FileInfo[] GetAllVideoFiles(string path)
         {
             DirectoryInfo directory = new DirectoryInfo(path);
-            FileInfo[] allFiles = directory.GetFiles("*", SearchOption.AllDirectories);
+            FileInfo[] allFiles = directory.GetFiles("", SearchOption.AllDirectories);
 
             return allFiles.Where(x => _fileExtensionCollection.Contains(x.Extension)).ToArray();
