[Killed] Block removal mutation
VideoParser.cs:25:3
 		/// <param name="title"></param>
 		/// <returns></returns>
 		protected string RemoveExtraInformation(string title)
-		{
-			string tempTitle = title;
-
-			if (tempTitle.Contains("[") && tempTitle.Contains("]"))
-			{
-				int indexStart = tempTitle.IndexOf('[');
-				int indexStop = tempTitle.IndexOf(']');
-				int count = indexStop - indexStart + 1;
-
-				tempTitle = tempTitle.Remove(indexStart, count);
-			}
-
-			if (tempTitle[0] == '.' || tempTitle[0] == ' ')
-				tempTitle = tempTitle.Remove(0, 1);
-
-			return tempTitle;
-		}
+		{}
 
 		protected string ReplaceCharacters(string title)
statusReason: not run

[Killed] Negate expression
VideoParser.cs:28:8
 		{
 			string tempTitle = title;
 
-			if (tempTitle.Contains("[") && tempTitle.Contains("]"))
+			if (!(tempTitle.Contains("[") && tempTitle.Contains("]")))
 			{
 				int indexStart = tempTitle.IndexOf('[');
statusReason: not run

[Survived] Logical mutation
VideoParser.cs:28:8
 		{
 			string tempTitle = title;
 
-			if (tempTitle.Contains("[") && tempTitle.Contains("]"))
+			if (tempTitle.Contains("[") || tempTitle.Contains("]"))
 			{
 				int indexStart = tempTitle.IndexOf('[');

[Killed] Block removal mutation
VideoParser.cs:29:4
 			string tempTitle = title;
 
 			if (tempTitle.Contains("[") && tempTitle.Contains("]"))
-			{
-				int indexStart = tempTitle.IndexOf('[');
-				int indexStop = tempTitle.IndexOf(']');
-				int count = indexStop - indexStart + 1;
-
-				tempTitle = tempTitle.Remove(indexStart, count);
-			}
+			{}
 
 			if (tempTitle[0] == '.' || tempTitle[0] == ' ')
statusReason: not run

[Killed] Arithmetic mutation
VideoParser.cs:32:17
 			{
 				int indexStart = tempTitle.IndexOf('[');
 				int indexStop = tempTitle.IndexOf(']');
-				int count = indexStop - indexStart + 1;
+				int count = indexStop - indexStart - 1;
 
 				tempTitle = tempTitle.Remove(indexStart, count);
statusReason: not run

[Survived] Arithmetic mutation
VideoParser.cs:32:17
 			{
 				int indexStart = tempTitle.IndexOf('[');
 				int indexStop = tempTitle.IndexOf(']');
-				int count = indexStop - indexStart + 1;
+				int count = indexStop + indexStart  + 1;
 
 				tempTitle = tempTitle.Remove(indexStart, count);

[Killed] Negate expression
VideoParser.cs:37:8
 				tempTitle = tempTitle.Remove(indexStart, count);
 			}
 
-			if (tempTitle[0] == '.' || tempTitle[0] == ' ')
+			if (!(tempTitle[0] == '.' || tempTitle[0] == ' '))
 				tempTitle = tempTitle.Remove(0, 1);
 
statusReason: not run

[Killed] Logical mutation
VideoParser.cs:37:8
 				tempTitle = tempTitle.Remove(indexStart, count);
 			}
 
-			if (tempTitle[0] == '.' || tempTitle[0] == ' ')
+			if (tempTitle[0] == '.' && tempTitle[0] == ' ')
 				tempTitle = tempTitle.Remove(0, 1);
 
statusReason: not run

[Killed] Block removal mutation
VideoParser.cs:44:3
 		}
 
 		protected string ReplaceCharacters(string title)
-		{
-			return title.Replace(' ', '.')
-				.Replace('-', '.')
-				.Replace('(', '.')
-				.Replace(')', '.');
-		}
+		{}
 
 
statusReason: not run
